Revit 2027 API
Ceramic.CeramicPatternAmount Property
 The property labeled "Amount" from the "Ceramic" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static string CeramicPatternAmount { get; }
Public Shared ReadOnly Property CeramicPatternAmount As String
	Get
public:
static property String^ CeramicPatternAmount {
	String^ get ();
}
static member CeramicPatternAmount : string with get
Property Value
String
Remarks
 This property is of type "AssetPropertyDouble" within the range of "0, 2".
See Also
Reference
Ceramic Class
Autodesk.Revit.DB.Visual Namespace